Урок 1. Контрольная работа
Данная работа необходима для проверки ваших знаний и навыков по итогу прохождения первого блока обучения на программе Разработчик. Мы должны убедится, что базовое знакомство с IT прошло успешно.

Задача алгоритмически не самая сложная, однако для полноценного выполнения проверочной работы необходимо:

1. Создать репозиторий на GitHub
2. Нарисовать блок-схему алгоритма (можно обойтись блок-схемой основной содержательной части, если вы выделяете её в отдельный метод)
3. Снабдить репозиторий оформленным текстовым описанием решения (файл README.md)
4. Написать программу, решающую поставленную задачу
5. Использовать контроль версий в работе над этим небольшим проектом (не должно быть так, что всё залито одним коммитом, как минимум этапы 2, 3, и 4 должны быть расположены в разных коммитах)

Задача: Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

Примеры:
[“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]
[“1234”, “1567”, “-2”, “computer science”] → [“-2”]
[“Russia”, “Denmark”, “Kazan”] → []


Пользователь вводит нужную ему длину массива преобразуем строку в число:
//
Console.Write("Введите длину массива: ");
int length = Convert.ToInt32(Console.ReadLine());
//
Создаём массив:
//
string[] array = new string[length];
//
Создаём метод с помощью которого пользователь запишет данные в каждую ячейку массива:
//
void FillArray(string[] array)
{
for (int i = 0; i < array.Length; i++)
{
    Console.Write($"Введите {i+1} элемент массива: ");
    array[i] = Console.ReadLine();
}
}
//
Создаём метод с помощью которого пользователь увидит массив в консоли:
//
void PrintArray(string[] array)
{
    for (int i = 0; i < array.Length; i++)
    {
        Console.Write($"{array[i]} ");
    }
}
//
Далее программа с помощью этих методов заполнит и выведет в консоль массив:
//
FillArray(array);
PrintArray(array);
//
Следующий метод выполняет три функции:
Первая находит длину нового массива:

//
string[] GetResultArray(string[] array)
{
    int lengthNewArray = 0; // счетчик размера нового массива
    string memory = " ";
    for (int i = 0; i < array.Length; i++)
    {
        memory = array[i];
        if (memory.Length<=3)
        {
            lengthNewArray++;
        }
    }
//
Вторая часть создаёт новый массив нужного размера
//
string[] result = new string[lengthNewArray];
//
Третья часть заполняет массив согласно условию задачи
//
  int j = 0; // счётчик для нового массива
    for (int i = 0; i < array.Length; i++)
    {
        memory = array[i];
        if (memory.Length<=3)
        {
             result[j]= memory;
             j++;
        }
    }
    return result;
}
//
Программа применяет данный метод используя массив записанный пользователем и выводит массив отвечающий условиям задачи в консоль
//
string[] newArray = GetResultArray(array);
PrintArray(newArray);
//
